; domain
(define (domain healthcare)
  (:requirements :strips :typing :fluents)

  (:types
    medical_unit inventory - location
    scissor band_aid syringes - content
    delivery_robot accompany_robot - robot
    carrier - box
    patient
  )

  (:predicates
    (robot_at ?r - robot ?l - location)
    ;(has ?m - medical_unit ?c - content)
    ;(empty ?b - box)
    (contains ?b - box ?c - content)
    (carrier_load ?c - carrier ?b - box)
    (carrier_at ?c - carrier ?l - location)
    ;(robot_carries_carrier ?r - robot ?c - carrier)
    (connected ?l1 - location ?l2 - location)
    (at_box ?b - box ?l - location)

    ;; patient stuff
    (free_to_accompany ?r - accompany_robot)
    (accompanying_pat ?p - patient ?ar - accompany_robot)
    (patient_at ?p - patient ?l - location)

  )

  (:functions
    (carrier_capacity ?c - carrier) ; Capacità massima del carrier
    (carrier_used ?c - carrier) ; Numero di scatole attualmente nel carrier
    (med_unit_inventory_of ?m - medical_unit ?c - content)
    (warehouse_inventory_of ?i - location ?c - content) ;;TODO aggiungere riempi scatola

  )
  ;; Spostare un robot
  (:action move
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (robot_at ?r ?from) (connected ?from ?to))
    :effect (and (not (robot_at ?r ?from)) (robot_at ?r ?to))
  )

  ;; Caricare una scatola nel carrier
  (:action load_to_carrier
    :parameters (?r - delivery_robot ?c - carrier ?b - box ?l - inventory)
    :precondition (and (robot_at ?r ?l) (carrier_at ?c ?l) (at_box ?b ?l)
      (< (carrier_used ?c) (carrier_capacity ?c))
      )
    :effect (and (not (at_box ?b ?l)) (carrier_load ?c ?b)
      (increase (carrier_used ?c) 1))
  )

  ;; Scaricare una scatola dal carrier
  (:action unload_from_carrier ;;in caso di necessitá i robot si possono passare il carrier a metá strada
    :parameters (?r - delivery_robot ?c - carrier ?b - box ?l - location)
    :precondition (and (robot_at ?r ?l) (carrier_at ?c ?l) (carrier_load ?c ?b))
    :effect (and (at_box ?b ?l) (not (carrier_load ?c ?b))
      (decrease (carrier_used ?c) 1))
  )

  ;; Muovere un carrier con il robot
  ;(:action connect_to_carrier
  ;  :parameters (?r - robot ?c - carrier ?l - location)
  ;  :precondition (and (robot_at ?r ?l) (carrier_at ?c ?l))
  ;  :effect (and (not (carrier_at ?c ?l))
  ;    (robot_carries_carrier ?r ?c))
  ;)
;
  ;; Muovere un carrier con il robot
  ;(:action disconnect_from_carrier
  ;  :parameters (?r - robot ?c - carrier ?l - location)
  ;  :precondition (and (robot_at ?r ?l) (robot_carries_carrier ?r ?c))
  ;  :effect (and (not (robot_carries_carrier ?r ?c))
  ;  (carrier_at ?c ?l))
  ;)

  ;; Muovere un carrier con il robot
  (:action move_carrier
    :parameters (?r - delivery_robot ?c - carrier ?from - location ?to - location)
    :precondition (and (robot_at ?r ?from) (carrier_at ?c ?from) (connected ?from ?to))
    :effect (and (not (carrier_at ?c ?from)) (carrier_at ?c ?to)
      (not (robot_at ?r ?from)) (robot_at ?r ?to))
  )
  ;; Scaricare il contenuto da una scatola in un'unità medica
  (:action unload_content
    :parameters (?r - delivery_robot ?b - box ?m - medical_unit ?c - content)
    :precondition (and (robot_at ?r ?m) (at_box ?b ?m) (contains ?b ?c))
    :effect (and (not (contains ?b ?c)) (increase (med_unit_inventory_of ?m ?c) 1)) ;(has ?m ?c)
  )

  ;;Patient position can be derived from the accompanying robot (makes more sense since is easier to track a robot than the patient in real life)
  (:action take_patient
    :parameters (?ar - accompany_robot ?w - location ?p - patient)
    :precondition (and (robot_at ?ar ?w) (free_to_accompany ?ar) (patient_at ?p ?w))
    :effect (and (not(patient_at ?p ?w)) (not(free_to_accompany ?ar)) (accompanying_pat ?p ?ar))
  )
  ;; Could be changed to move patient only between waiting rooms 
  (:action deliver_patient
    :parameters (?ar - accompany_robot ?m - medical_unit ?p - patient)
    :precondition (and (robot_at ?ar ?m) (accompanying_pat ?p ?ar))
    :effect (and (not (accompanying_pat ?p ?ar)) (free_to_accompany ?ar) (patient_at ?p ?m))
  )

)

; problem
(define (problem healthcare_problem)
  (:domain healthcare)

  (:objects
    central_warehouse - inventory
    entrance location1 location2 - location
    scalpel tongue_depressor aspirin - content
    box1 box2 box3 box4 box5 - box
    robot1 - delivery_robot
    accompany_robot1 - accompany_robot
    carrier1 carrier2 carrier3 - carrier
    patient1 patient2 - patient
    medical_unit1 medical_unit2 medical_unit3 - medical_unit
  )

  (:init
    ; Posizioni iniziali dei robot e dei pazienti
    (robot_at robot1 central_warehouse)
    ;(robot_at robot2 central_warehouse)
    ;(robot_at robot3 central_warehouse)
    ;(robot_at accompany_robot1 entrance)
    ;(patient_at patient1 entrance)
    ;(patient_at patient2 entrance)

    ; Posizione iniziale delle scatole
    (at_box box1 central_warehouse)
    (at_box box2 central_warehouse)
    (at_box box3 central_warehouse)
    (at_box box4 central_warehouse)
    (at_box box5 central_warehouse)

    ; Posizione iniziale dei carrier
    (carrier_at carrier1 central_warehouse)
    (carrier_at carrier2 central_warehouse)
    (carrier_at carrier3 central_warehouse)

    ; Definizione della capacità dei carrier
    (= (carrier_capacity carrier1) 3)
    (= (carrier_capacity carrier2) 2)
    (= (carrier_capacity carrier3) 4)

    (= (carrier_used carrier1) 0)
    (= (carrier_used carrier2) 0)
    (= (carrier_used carrier3) 0)
    ;;Inventario
    (= (med_unit_inventory_of medical_unit1 aspirin) 0 )
    (= (med_unit_inventory_of medical_unit1 scalpel) 0)

    ; Contenuti iniziali nelle scatole
    (contains box1 aspirin)
    (contains box2 aspirin)
    ;(contains box3 aspirin)
    ;(contains box4 aspirin)
    ;(contains box5 aspirin)

    ; Connessioni tra le location
    (connected central_warehouse medical_unit1)
    (connected location1 location2)
    (connected location2 entrance)
  )

  (:goal
    (and
      ;(carrier_at carrier1 medical_unit1)
      ;(contains box1 aspirin)
      ;(carrier_load carrier1 box1)
      (= 2 (med_unit_inventory_of medical_unit1 aspirin))
      ;(has medical_unit1 scalpel)
      ;(has medical_unit1 tongue_depressor)
      ;(has medical_unit2 aspirin)
      ;(has medical_unit3 scalpel)
      ;(has medical_unit3 aspirin)
    )
  )
)

; plan
1. (load_to_carrier robot1 carrier1 box1 central_warehouse)
   deleted: (at_box box1 central_warehouse)
   added: (carrier_load carrier1 box1)
   changed: (carrier_used carrier1) from 0 to 1
   goals met: 0 of 1
2. (load_to_carrier robot1 carrier1 box2 central_warehouse)
   deleted: (at_box box2 central_warehouse)
   added: (carrier_load carrier1 box2)
   changed: (carrier_used carrier1) from 1 to 2
   goals met: 0 of 1
3. (move_carrier robot1 carrier1 central_warehouse medical_unit1)
   deleted: (carrier_at carrier1 central_warehouse) (robot_at robot1 central_warehouse)
   added: (carrier_at carrier1 medical_unit1) (robot_at robot1 medical_unit1)
   goals met: 0 of 1
4. (unload_from_carrier robot1 carrier1 box2 medical_unit1)
   deleted: (carrier_load carrier1 box2)
   added: (at_box box2 medical_unit1)
   changed: (carrier_used carrier1) from 2 to 1
   goals met: 0 of 1
5. (unload_content robot1 box2 medical_unit1 aspirin)
   deleted: (contains box2 aspirin)
   changed: (med_unit_inventory_of medical_unit1 aspirin) from 0 to 1
   goals met: 0 of 1
6. (unload_from_carrier robot1 carrier1 box1 medical_unit1)
   deleted: (carrier_load carrier1 box1)
   added: (at_box box1 medical_unit1)
   changed: (carrier_used carrier1) from 1 to 0
   goals met: 0 of 1
7. (unload_content robot1 box1 medical_unit1 aspirin)
   deleted: (contains box1 aspirin)
   changed: (med_unit_inventory_of medical_unit1 aspirin) from 1 to 2
   goals met: 1 of 1
